app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Travis"], ["LIMIT", 1]]
---
    def find_by_credentials(email, password)
        user = User.find_by(email: email)